//*****************************************************************************
//
// インプットイベントバッファクラス
//
// Author		: Kenji Kabutomori
//
//*****************************************************************************

//*****************************************************************************
// インクルード
//*****************************************************************************
#include "interface/input/event_buffer.h"

//=============================================================================
// コンストラクタ
//=============================================================================
CEventBuffer::CEventBuffer(WINDOW_DATA* window_data)
{
	window_data_ = window_data;
	ZeroMemory(input_event_list_,sizeof(input_event_list_));
	ZeroMemory(input_event_value_list_,sizeof(input_event_value_list_));
}

//=============================================================================
// デストラクタ
//=============================================================================
CEventBuffer::~CEventBuffer(void) {
}

//=============================================================================
// 初期化処理
//=============================================================================
bool CEventBuffer::Init(void)
{
	HRESULT hresult;

	// ダイレクトインプットの生成
	hresult = DirectInput8Create(window_data_->_hinstance,DIRECTINPUT_VERSION,IID_IDirectInput8,(void **)&direct_input_,NULL);

	// 生成の成功確認
	if(FAILED(hresult))
	{
		return false;
	}

	return true;
}

//=============================================================================
// 終了処理
//=============================================================================
void CEventBuffer::Uninit(void)
{
	// ダイレクトインプットの破棄
	if(direct_input_ != NULL)
	{
		direct_input_->Release();
		direct_input_ = NULL;
	}
}

//---------------------------------- EOF --------------------------------------
