//*****************************************************************************
//
// 4次元ベクトルクラス
//
// Author		: Kenji Kabutomori
//
//*****************************************************************************

//*****************************************************************************
/**
*
*	4次元ベクトルクラス
*
*	4次元ベクトルで使う処理もここに書く
*
*/
//*****************************************************************************

//*****************************************************************************
// 二重定義防止
//*****************************************************************************
#pragma once

#ifndef _VECTOR4_H_
#define _VECTOR4_H_

//*****************************************************************************
// インクルード
//*****************************************************************************

//*****************************************************************************
// マクロ定義
//*****************************************************************************

//*****************************************************************************
// 定数定義
//*****************************************************************************

//*****************************************************************************
// 構造体定義
//*****************************************************************************
typedef struct VECTOR4
{
public:
	f32 _x;
	f32 _y;
	f32 _z;
	f32 _w;

	//-----------------------------------------------------
	// コンストラクタ

	/**
	*	デフォルトコンストラクタ
	*
	*	0.0fで初期化
	*
	*	@param	void
	*/
	VECTOR4(void){_x = 0.0f;_y = 0.0f;_z = 0.0f;_w = 0.0f;}

	/**
	*	コンストラクタ
	*
	*	要素を指定して初期化
	*
	*	@param	f32 x
	*	@param	f32 y
	*	@param	f32 z
	*	@param	f32 w
	*/
	VECTOR4(const f32& x,const f32& y,const f32& z,const f32& w){_x = x;_y = y;_z = z;_w = w;}

	/**
	*	コピーコンストラクタ
	*
	*	要素をコピーして初期化
	*
	*	@param	VECTOR4
	*/
	VECTOR4(const VECTOR4& vector){_x = vector._x;_y = vector._y;_z = vector._z;_w = vector._w;}

	//-----------------------------------------------------
	// ベクトルの関数

	/**
	*	単位ベクトル化
	*
	*	ベクトルを単位ベクトルにする
	*
	*	@param	void
	*	@return	void
	*/
	void Normalize(void);

	/**
	*	ベクトルの大きさの取得
	*
	*	ベクトルの大きさを取得する
	*
	*	@param	void
	*	@return	f32 ベクトルの大きさ
	*/
	f32 Magnitude(void) const;

	//-----------------------------------------------------
	// 符号変換

	VECTOR4 operator+(void){return *this;}
	VECTOR4 operator-(void){return VECTOR4(-_x,-_y,-_z,-_w);}

	//-----------------------------------------------------
	// スカラーとの計算

	VECTOR4 operator+(const f32& value) const;
	VECTOR4 operator-(const f32& value) const;
	VECTOR4 operator*(const f32& value) const;
	VECTOR4 operator/(const f32& value) const;

	VECTOR4& operator+=(const f32& value);
	VECTOR4& operator-=(const f32& value);
	VECTOR4& operator*=(const f32& value);
	VECTOR4& operator/=(const f32& value);

	//-----------------------------------------------------
	// ベクトルとの計算

	VECTOR4 operator+(const VECTOR4& vector) const;
	VECTOR4 operator-(const VECTOR4& vector) const;

	VECTOR4& operator+=(const VECTOR4& vector);
	VECTOR4& operator-=(const VECTOR4& vector);

}VECTOR4;

#endif // _VECTOR4_H_

//---------------------------------- EOF --------------------------------------
