//=============================================================================
//
// テクスチャロード処理 [TextureLoader.h]
// Author : Ryo Kobayashi
// LastUpdate : 2014/4/21
//
//=============================================================================
#pragma once
#ifndef __KBR_TEXTURE_LOADER_H__
#define __KBR_TEXTURE_LOADER_H__

//*****************************************************************************
// インクルードファイル
//*****************************************************************************
#include <Windows.h>

//*****************************************************************************
// プロトタイプ関数
//*****************************************************************************
// テクスチャロード処理
BOOL LoadTexture(const char* pTexName, unsigned char** ppTex, unsigned short* pWidth, unsigned short* pHeight);
// ロードしたテクスチャの開放
void DeleteTexture(unsigned char** ppTex);

#endif	// __KBR_TEXTURE_LOADER_H__

// EOF