//*****************************************************************************
//
// プレイヤークラス [player.cpp]
//
// Author		: KENJI KABUTOMORI
// Date			: 2014/09/25(Thu)
// Version		: 1.00
// Update Date	: 2014/09/25(Thu)
//
//*****************************************************************************

//*****************************************************************************
// インクルード
//*****************************************************************************
#include "player.h"

#include "interface_manager.h"
#include "object_manager.h"
#include "object_3d_manager.h"
#include "object_model.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************

//*****************************************************************************
// グローバル変数
//*****************************************************************************

//=============================================================================
// コンストラクタ
//=============================================================================
CPlayer::CPlayer(CInterfaceManager* pInterfaceManager)
{
	// インターフェースマネージャーの設定
	m_pInterfaceManager = pInterfaceManager;

	m_Pos = VECTOR3(0.0f,0.0f,0.0f);
	m_Rot = VECTOR3(0.0f,0.0f,0.0f);
}

//=============================================================================
// デストラクタ
//=============================================================================
CPlayer::~CPlayer(void)
{
}

//=============================================================================
// 初期化
//=============================================================================
bool CPlayer::Init(void)
{
	CObjectManager* pObjectManager = m_pInterfaceManager->GetObjectManager();
	CObject3DManager* pObject3DManager = pObjectManager->GetObject3DManager();
	CGraphicsDevice* pGraphicsDevice = pObjectManager->GetGraphicsDevice();
	CObjectModel* pObjectModel = NULL;

	pObjectModel = CObjectModel::Create(pGraphicsDevice,"data/model/player");

	m_nNumber = pObject3DManager->Add(pObjectModel);

	return true;
}

//=============================================================================
// 更新
//=============================================================================
void CPlayer::Update(void)
{
}

//=============================================================================
// 描画
//=============================================================================
void CPlayer::Draw(void)
{
	CObjectManager* pObjectManager = m_pInterfaceManager->GetObjectManager();
	CObject3DManager* pObject3DManager = pObjectManager->GetObject3DManager();

	//pObject3DManager->Draw(m_nNumber,m_Pos,m_Rot,NULL);
}

//=============================================================================
// 終了
//=============================================================================
void CPlayer::Uninit(void)
{
}

//---------------------------------- EOF --------------------------------------
