//*****************************************************************************
//
// ユーザーナンバークラス(プレイヤーの上に出るアレ)
//
// Author		: Kazuma Ooigawa
//
//*****************************************************************************

//*****************************************************************************
// 多重定義防止
//*****************************************************************************
#pragma once

#ifndef _USER_NUMBER_H_
#define _USER_NUMBER_H_

//*****************************************************************************
// インクルード
//*****************************************************************************
#include "common/math/math.h"
#include "../character_interface.h"

//*****************************************************************************
// ライブラリのリンク
//*****************************************************************************

//*****************************************************************************
// マクロ定義
//*****************************************************************************

//*****************************************************************************
// 構造体定義
//*****************************************************************************

//*****************************************************************************
// クラスの前方参照
//*****************************************************************************
class CInterfaceManager;
class CBillboard;

//*****************************************************************************
// クラス定義
//*****************************************************************************
class CUserNumber : public CCharacterInterface
{
public:
	// コンストラクタ
	CUserNumber(CInterfaceManager* interface_manager);

	// デストラクタ
	~CUserNumber(void);

	// 初期化
	bool Init(void);

	// 更新
	void Update(void);

	// 描画
	void Draw(void);

	// 終了
	void Uninit(void);

	// パラメータの設定
	void SetParameter(const VECTOR3& position , const s32& player_id );

	//位置取得
	VECTOR3 position( void ){ return position_; }

	//プレイヤーID取得
	s32 player_id( void ){ return player_id_;}

	//位置セット
	void set_position( const VECTOR3& pos ){ position_ = pos ;}

	//消去
	void Erase( void );
private:
	u32 object_key_;
	VECTOR3 position_;
	s32 player_id_;
	CInterfaceManager* interface_manager_;
};
#endif //_USER_NUMBER_H_
//---------------------------------- EOF --------------------------------------
