//*****************************************************************************
//
// エネミーテストクラス [enemy_test3d.cpp]
//
// Author		: KENJI KABUTOMORI
// Date			: 2014/04/21(Mon)
// Version		: 1.00
// Update Date	: 2014/05/14(Wed)
//
//*****************************************************************************

//*****************************************************************************
// インクルード
//*****************************************************************************
#include "enemy_test3d.h"

#include "object_manager.h"
#include "rectangle_3d.h"
#include "object_3d_manager.h"

#include "texture_manager.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************

//*****************************************************************************
// 定数定義
//*****************************************************************************
const VECTOR2 CEnemyTest3D::DEFAULT_SIZE = VECTOR2(10.0f,10.0f);
const int CEnemyTest3D::OBJECT_MAX = 1;

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************

//*****************************************************************************
// グローバル変数
//*****************************************************************************

//=============================================================================
// コンストラクタ
//=============================================================================
CEnemyTest3D::CEnemyTest3D(CObjectManager* pObjectManager,int* pNumbers) : CEnemy(ENEMY_TYPE_TEST3D)
{
	// オブジェクトマネージャーの登録
	m_pObjectManager = pObjectManager;

	// 座標の初期化
	m_Position = VECTOR3(0.0f,0.0f,0.0f);

	// オブジェクト番号の保存
	m_pNumber = pNumbers;
}

//=============================================================================
// デストラクタ
//=============================================================================
CEnemyTest3D::~CEnemyTest3D(void)
{
}

//=============================================================================
// オブジェクトの生成処理
//=============================================================================
int CEnemyTest3D::CreateObject(int** pOutNumbers)
{
	CObject3DManager* pObject3DManager;
	CObject3D* pObject3D = NULL;

	*pOutNumbers = new int[OBJECT_MAX];

	pObject3DManager = m_pObjectManager->GetObject3DManager();

	for(int i = 0;i < OBJECT_MAX;i++)
	{
		//pObject3D = new CRectangle3D();

		//pObject3D->Init();
		//*pOutNumbers[i] = pObject3DManager->Create(DEFAULT_SIZE);
	}

	return OBJECT_MAX;
}

//=============================================================================
// 更新処理
//=============================================================================
void CEnemyTest3D::Update(void)
{
}

//=============================================================================
// 描画処理
//=============================================================================
void CEnemyTest3D::Draw(void)
{
	CObject3DManager* pObject3DManager;
	CTextureManager* pTextureManager;
	CTexture* pTexture = NULL;

	// 3Dマネージャの取得
	pObject3DManager = m_pObjectManager->GetObject3DManager();

	// テクスチャマネージャーの取得
	pTextureManager = m_pObjectManager->GetTextureManager();

	// テクスチャマネージャからテクスチャの取得
	pTexture = pTextureManager->Get("enemytest");

	// 3Dマネージャに描画登録
	//pObject3DManager->Draw(*m_pNumber,m_Position,"enemytest");
}

//=============================================================================
// 破棄処理
//=============================================================================
void CEnemyTest3D::Release(void)
{
	CEnemy::Release();
}

//---------------------------------- EOF --------------------------------------
