//*****************************************************************************
//
// 矩形2Dクラス
//
// Author		: Kenji Kabutomori
//
//*****************************************************************************

//*****************************************************************************
// 多重定義防止
//*****************************************************************************
#pragma once

#ifndef _FADE_2D_H_
#define _FADE_2D_H_

//*****************************************************************************
// インクルード
//*****************************************************************************
#include "../object_2d.h"

//*****************************************************************************
// ライブラリのリンク
//*****************************************************************************

//*****************************************************************************
// マクロ定義
//*****************************************************************************

//*****************************************************************************
// 構造体定義
//*****************************************************************************

//*****************************************************************************
// クラスの前方参照
//*****************************************************************************
class CTexture;
class CGraphicsDevice;
class CVertex3D;
class CRectangle2D;
class CInterfaceManager;

//*****************************************************************************
// クラス定義
//*****************************************************************************
class CFade2D : public CObject2D
{
public:

	// コンストラクタ
	CFade2D(CDeviceHolder* device_holder,CInterfaceManager* interface_manager);

	// デストラクタ
	virtual ~CFade2D(void);

	enum FADE_TYPE
	{
		FADE_TYPE_NONE,
		FADE_TYPE_IN,
		FADE_TYPE_IN_END,
		FADE_TYPE_OUT,
		FADE_TYPE_OUT_END,
	};

	// 初期化処理
	bool Init(void);

	// 描画処理
	void Draw(CObject2DData* pObject2DData);

	// 終了処理
	void Uninit(void);

	// 頂点情報の設定
	void Set(void);

protected:
	// 頂点情報
	CVertex2D* vertex_2d_;
	CRectangle2D* rectangle_2d_;
	u32 rectangle_2d_key_;
	FADE_TYPE fadetype_;
	f32 alpha_;

	// インターフェースマネージャー
	CInterfaceManager* interface_manager_;
private:

};

#endif	// _RECTANGLE_2D_H_

//---------------------------------- EOF --------------------------------------
