//*****************************************************************************
//
// キーボードクラス
//
// Author		: Kenji Kabutomori
//
//*****************************************************************************

//*****************************************************************************
// 二重定義防止
//*****************************************************************************
#pragma once

#ifndef _KEYBOARD_H_
#define _KEYBOARD_H_

//*****************************************************************************
// インクルード
//*****************************************************************************
#include "interface/input/input_alias.h"
#include "interface/input/device/input_device.h"

//*****************************************************************************
// キーボードクラス
//*****************************************************************************
class CKeyboard : public CInputDevice
{
public:
	CKeyboard(CEventBuffer* event_buffer);
	virtual ~CKeyboard(void);

	bool Init(void);
	void Update(void);
	void Uninit(void);

private:
	static const u16 kKeyMax = 256;
	bool preview_key_[kKeyMax];

};

#endif // _DEVICE_KEYBOARD_H_

//---------------------------------- EOF --------------------------------------
