//*****************************************************************************
//
// マウスクラス
//
// Author		: Kenji Kabutomori
//
//*****************************************************************************

//*****************************************************************************
// 二重定義防止
//*****************************************************************************
#pragma once

#ifndef _MOUSE_H_
#define _MOUSE_H_

//*****************************************************************************
// インクルード
//*****************************************************************************
#include "interface/input/input_alias.h"
#include "interface/input/device/input_device.h"

//*****************************************************************************
// マウスクラス
//*****************************************************************************
class CMouse : public CInputDevice
{
public:
	CMouse(CEventBuffer* event_buffer);
	virtual ~CMouse(void);

	bool Init(void);
	void Update(void);
	void Uninit(void);

 private:
	static const u8 kPushBit = 0x80;
	static const u16 kKeyMax = 3;
	bool preview_key_[kKeyMax];

};

#endif // _MOUSE_H_

//---------------------------------- EOF --------------------------------------
