//*****************************************************************************
//
// テクスチャマネージャークラス
//
// Author		: Kenji Kabutomori
//
//*****************************************************************************

//*****************************************************************************
// インクルード
//*****************************************************************************
#include <windows.h>
// basic
#include "basic/application.h"

// graphic
#include "interface/graphic/texture/texture_manager.h"
#ifdef _USING_OPENGL_
#include "interface/graphic/texture/opengl/gl_texture.h"
#endif
#ifdef _USING_DIRECTX_
#include "interface/graphic/texture/directx/dx_texture.h"
#endif

// common
#include "common/common.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************

//*****************************************************************************
// グローバル変数
//*****************************************************************************

//=============================================================================
// デフォルトコンストラクタ
//=============================================================================
CTextureManager::CTextureManager(CDeviceHolder* device_holder)
{
	// グラフィックデバイスの設定
	device_holder_ = device_holder;
}

//=============================================================================
// デストラクタ
//=============================================================================
CTextureManager::~CTextureManager(void)
{
}

//=============================================================================
// 初期化処理
//=============================================================================
bool CTextureManager::Init(void)
{
	bool bRet;

	bRet = CFileManager::Init();

	return true;
}

//=============================================================================
// 終了処理
//=============================================================================
void CTextureManager::Uninit(void)
{
	CFileManager::Uninit();
}

//=============================================================================
// 作成処理
//=============================================================================
CTexture* CTextureManager::Create(std::string filename)
{
	CTexture* pTexture = NULL;

#ifdef _USING_OPENGL_
	pTexture = new CGLTexture(device_holder_);
#endif

#ifdef _USING_DIRECTX_
	pTexture = new CDXTexture(device_holder_);
#endif

	// 初期化
	pTexture->Init();

	// ロード
	pTexture->Load(filename.c_str());

	return pTexture;
}

//=============================================================================
// 開放処理
//=============================================================================
void CTextureManager::ReleaseData(CTexture* texture)
{
	SAFE_RELEASE(texture);
}

//---------------------------------- EOF --------------------------------------
