//*****************************************************************************
//
// アイコン(2D)クラス
//
// Author		: Kazuma Ooigawa
//
//*****************************************************************************

//*****************************************************************************
// 多重定義防止
//*****************************************************************************
#pragma once

#ifndef _ICON_2D_H_
#define _ICON_2D_H_

//*****************************************************************************
// インクルード
//*****************************************************************************
#include "common/math/math.h"
#include "../../character_interface.h"

//*****************************************************************************
// ライブラリのリンク
//*****************************************************************************

//*****************************************************************************
// マクロ定義
//*****************************************************************************

//*****************************************************************************
// 構造体定義
//*****************************************************************************
typedef enum
{
	PLAYER_ID_1P = 0,
	PLAYER_ID_2P,
	PLAYER_ID_3P,
	PLAYER_ID_4P
}PLAYER_ID;
//*****************************************************************************
// クラスの前方参照
//*****************************************************************************
class CInterfaceManager;
class CRectangle2D;

//*****************************************************************************
// クラス定義
//*****************************************************************************
class CIcon2D : public CCharacterInterface
{
public:
	// コンストラクタ
	CIcon2D(CInterfaceManager* interface_manager , int player_id , f32 scale );

	// デストラクタ
	~CIcon2D(void);

	// 初期化
	bool Init(void);

	// 更新
	void Update(void);

	// 描画
	void Draw(void);

	// 終了
	void Uninit(void);

	//位置取得
	VECTOR2 position( void ){ return position_; }

	//位置セット
	void set_position( const VECTOR2& pos ){ position_ = pos ;}

	//消去
	void Erase( void );
private:
	static const f32 POLYGON_SIZE;
	f32 scale_;
	u32 object_key_;
	int player_id_;
	VECTOR2 position_;
	CRectangle2D* rectangle_2d_;
	CInterfaceManager* interface_manager_;
};
#endif //_ICON_2D_H_
//---------------------------------- EOF --------------------------------------
