//*****************************************************************************
//
// ユーザーナンバー(2D)クラス
//
// Author		: Kazuma Ooigawa
//
//*****************************************************************************

//*****************************************************************************
// 多重定義防止
//*****************************************************************************
#pragma once

#ifndef _USER_NUMBER_2D_H_
#define _USER_NUMBER_2D_H_

//*****************************************************************************
// インクルード
//*****************************************************************************
#include "common/math/math.h"
#include "../../character_interface.h"

//*****************************************************************************
// ライブラリのリンク
//*****************************************************************************

//*****************************************************************************
// マクロ定義
//*****************************************************************************

//*****************************************************************************
// 構造体定義
//*****************************************************************************

//*****************************************************************************
// クラスの前方参照
//*****************************************************************************
class CInterfaceManager;
class CRectangle2D;

//*****************************************************************************
// クラス定義
//*****************************************************************************
class CUserNumber2D : public CCharacterInterface
{
public:
	// コンストラクタ
	CUserNumber2D(CInterfaceManager* interface_manager , s32 max_length );

	// デストラクタ
	~CUserNumber2D(void);

	// 初期化
	bool Init(void);

	// 更新
	void Update(void);

	// 描画
	void Draw(void);

	// 終了
	void Uninit(void);

	// パラメータの設定
	void SetParameter(const VECTOR2& position , const s32& player_id );

	//位置取得
	VECTOR2 position( void ){ return position_; }

	//プレイヤーID取得
	s32 player_id( void ){ return player_id_;}

	//ライフ取得
	s32 user_number( void ){ return user_number_;}

	//位置セット
	void set_position( const VECTOR2& pos ){ position_ = pos ;}

	//ユーザーナンバーセット
	void set_user_number( const s32 user_number ){ user_number_ = user_number;}

	//消去
	void Erase( void );
private:
	u32 object_key_;
	VECTOR2 position_;
	u32 max_user_number_;
	s32 user_number_;
	u32 max_length_;
	s32 length_;
	s32 player_id_;
	CRectangle2D* rectangle_2d_;
	CInterfaceManager* interface_manager_;
};
#endif //_USER_NUMBER_2D_H_
//---------------------------------- EOF --------------------------------------
