//*****************************************************************************
//
// アプリケーションの設定
//
// Author		: Kenji Kabutomori
//
//*****************************************************************************

//*****************************************************************************
/**
*
*	アプリケーションで使うデバイス等をここで宣言
*
*	ここで宣言しないものや重複しては困るものをマクロで定義する
*
*/
//*****************************************************************************

//*****************************************************************************
// 二重定義防止
//*****************************************************************************
#pragma once

#ifndef _APPLICATION_H_
#define _APPLICATION_H_

//*****************************************************************************
// マクロ定義
//*****************************************************************************
//#define _USING_DIRECTX_		// DirectXを使うことを宣言

#ifndef _USING_DIRECTX_		// DirectXを使わない場合

#define _USING_OPENGL_		// OpenGLを使うことを宣言

#ifndef _USING_OPENGL_

#endif	// _USING_OPENGL_

#endif	// _USING_DIRECTX_

#define _USING_XAUDIO2_		// xAudio2を使うことを宣言

#ifndef _USING_XAUDIO2_		// xAudio2を使わない場合

#endif	// _USING_XAUDIO2_

#endif	// _APPLICATION_H_

//---------------------------------- EOF --------------------------------------
