//*****************************************************************************
//
// メッシュドームクラス
//
// Author		: Kenji Kabutomori
//
//*****************************************************************************
#pragma once
#ifndef _MESHDOME_H_
#define _MESHDOME_H_

//*****************************************************************************
// インクルード
//*****************************************************************************
// graphic
#include "interface/graphic/object/object_3d/element/object_3d.h"

//*****************************************************************************
// ライブラリのリンク
//*****************************************************************************

//*****************************************************************************
// マクロ定義
//*****************************************************************************

//*****************************************************************************
// 構造体定義
//*****************************************************************************

//*****************************************************************************
// クラスの前方参照
//*****************************************************************************
class CVertex3D;
struct COLOR4F;

//*****************************************************************************
// クラス定義
//*****************************************************************************
class CMeshdome : public CObject3D
{
public:
	// コンストラクタ
	CMeshdome(CDeviceHolder* device_holder);

	// デストラクタ
	virtual ~CMeshdome(void);

	// 初期化処理
	bool Init(void);

	// 描画処理
	void Draw(CObject3DData* object_3d_data);

	// 終了処理
	void Uninit(void);

	// 頂点情報の設定
	void Set(void);

	// グリッド数の設定
	void SetGridNumber(const u32& grid_x_number,const u32& grid_z_number){grid_x_number_ = grid_x_number;grid_z_number_ = grid_z_number;}

	// 半径の設定
	void set_radius(const f32& radius){radius_ = radius;}

private:
	f32 radius_;
	u32 grid_x_number_;
	u32 grid_z_number_;
	CVertex3D* vertex_;
};

#endif	// _MESHDOME_H_

//---------------------------------- EOF --------------------------------------
