//*****************************************************************************
//
// オブジェクトモデルクラス
//
// Author		: Kenji Kabutomori
//
//*****************************************************************************

//*****************************************************************************
// インクルード
//*****************************************************************************
// basic
#include "basic/application.h"

// graphic
#ifdef _USING_OPENGL_
//#include "interface/graphic/model/opengl/gl_object_model.h"
#endif
#ifdef _USING_DIRECTX_
#include "interface/graphic/model/dx_object_model.h"
#endif
#include "interface/graphic/object/object_3d/element/object_model.h"
#include "interface/graphic/object/object_3d/object_3d_data.h"
#include "interface/graphic/model/model_manager.h"

// common
#include "common/common.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************

//*****************************************************************************
// 定数定義
//*****************************************************************************

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************

//*****************************************************************************
// グローバル変数
//*****************************************************************************

//=============================================================================
// コンストラクタ
//=============================================================================
CObjectModel::CObjectModel(CDeviceHolder* device_holder,const char* model_name) : CObject3D(device_holder,OBJECT_3D_TYPE_OBJECT_MODEL)
{
	int nLen = 0;
	nLen = strlen(model_name);

	model_name_ = new char[nLen + 1];

	strcpy(model_name_,model_name);
}

//=============================================================================
// デストラクタ
//=============================================================================
CObjectModel::~CObjectModel(void)
{
	SAFE_DELETE_ARRAY(model_name_);
}

//=============================================================================
// 初期化
//=============================================================================
bool CObjectModel::Init(void)
{
	return true;
}

//=============================================================================
// 描画
//=============================================================================
void CObjectModel::Draw(CObject3DData* object_3d_data)
{
	MATRIX4x4 matrix = GetWorldMatrix(object_3d_data);
	CModel* model = object_3d_data->model_manager()->Get(model_name_);
	CRenderstate* renderstate = NULL;//object_3d_data->renderstate();

	object_3d_data->object_3d()->Draw(matrix,model,renderstate);
}

//=============================================================================
// 終了
//=============================================================================
void CObjectModel::Uninit(void)
{
}

//---------------------------------- EOF --------------------------------------
