//*****************************************************************************
//
// グラフィックデバイスクラス
//
// Author		: Kenji Kabutomori
//
//*****************************************************************************

//*****************************************************************************
/**
*
*	描画デバイスを管理する
*
*/
//*****************************************************************************

//*****************************************************************************
// 二重定義防止
//*****************************************************************************
#pragma once

#ifndef _GRAPHIC_DEVICE_H_
#define _GRAPHIC_DEVICE_H_

//*****************************************************************************
// インクルード
//*****************************************************************************
#include "basic/basic.h"
#include "basic/application.h"
#include "basic/main_window.h"

//*****************************************************************************
// ライブラリのリンク
//*****************************************************************************

//*****************************************************************************
// マクロ定義
//*****************************************************************************

//*****************************************************************************
// 構造体定義
//*****************************************************************************

//*****************************************************************************
// 前方宣言
//*****************************************************************************
#ifdef _USING_DIRECTX_
class CDirectx;
#endif // _USING_DIRECTX_

#ifdef _USING_OPENGL_
class COpengl;
#endif // _USING_OPENGL_

//*****************************************************************************
// クラス定義
//*****************************************************************************
class CGraphicDevice : public CBasic
{
public:
	typedef enum _DEVICE_MODE
	{
		DEVICE_MODE_MAIN = 0,
		DEVICE_MODE_LOAD,
		DEVICE_MODE_MAX
	}DEVICE_MODE;

	// コンストラクタ
	CGraphicDevice(WINDOW_DATA* window_data);

	// デストラクタ
	virtual ~CGraphicDevice(void);

	// 描画開始
	virtual void BeginDraw(void) = 0;

	// 描画終了
	virtual void EndDraw(void) = 0;

	// ロードの開始
	virtual void BeginLoad(void) = 0;

	// ロードの終了
	virtual void EndLoad(void) = 0;

	// スクリーンショット
	virtual void ScreenShot(const s8* filename) = 0;

	// 描画モードの設定
	virtual void SetDrawMode(const DEVICE_MODE& device_mode){draw_mode_ = device_mode;}

	// ロードモードの設定
	virtual void SetLoadMode(const DEVICE_MODE& device_mode){load_mode_ = device_mode;}

protected:
	WINDOW_DATA* window_data_;
	DEVICE_MODE draw_mode_;
	DEVICE_MODE load_mode_;
};

#endif // _GRAPHICS_API_H_

//---------------------------------- EOF --------------------------------------
