//*****************************************************************************
//
// ネットワークデータバッファクラス [network_data_buffer.h]
//
// Author		: KENJI KABUTOMORI
// Date			: 2014/09/17(Wed)
// Version		: 1.00
// Update Date	: 2014/09/17(Wed)
//
//*****************************************************************************

//*****************************************************************************
// 多重定義防止
//*****************************************************************************
#pragma once

#ifndef _NETWORK_DATA_BUFFER_H_
#define _NETWORK_DATA_BUFFER_H_

//*****************************************************************************
// インクルード
//*****************************************************************************
#include "basic.h"
#include "network_data.h"

//*****************************************************************************
// ライブラリのリンク
//*****************************************************************************

//*****************************************************************************
// マクロ定義
//*****************************************************************************

//*****************************************************************************
// 構造体定義
//*****************************************************************************

//*****************************************************************************
// クラスの前方参照
//*****************************************************************************
namespace std
{
	template < class T > class allocator;
	template < class T, class Allocator > class list;
}

#define LIST_FWD(x_type)  std::list<x_type, std::allocator<x_type> >

//*****************************************************************************
// クラス定義
//*****************************************************************************
class CNetworkDataBuffer : public CBasic
{
public:
	// コンストラクタ
	CNetworkDataBuffer(void);

	// デストラクタ
	virtual ~CNetworkDataBuffer(void);

	// 初期化処理
	bool Init(void);

	// 終了処理
	void Uninit(void);

	// データの追加
	void Push(NETWORK_DATA pData);

	// データの取り出し
	NETWORK_DATA Pop(void);

	// 空か確認
	bool Empty(void);

	// 変更
	void Change(void);

	void RaiseChangeFlag(void){m_bChangeFlag = true;}
	bool GetChangeFlag(void){return m_bChangeFlag;}
protected:

private:
	enum LIST_TYPE
	{
		LIST_TYPE_USE = 0,
		LIST_TYPE_CONTAINER,
		LIST_TYPE_MAX
	};
	LIST_FWD(NETWORK_DATA)* m_pList[LIST_TYPE_MAX];

	bool m_bChangeFlag;
};

#endif	// _NETWORK_DATA_BUFFER_H_

//---------------------------------- EOF --------------------------------------
