//*****************************************************************************
//
// WindowsSocketsクラス [windows_sockets.h]
//
// Author		: 兜森 健史
// Date			: 2014/05/07(Wed)
// Version		: 1.00
// Modified by	: 兜森 健史
// Update date	: 2014/05/14(Wed)
//
//*****************************************************************************

//*****************************************************************************
// 二重定義防止
//*****************************************************************************
#pragma once

#ifndef _WINDOWS_SOCKET_H_
#define _WINDOWS_SOCKET_H_

//*****************************************************************************
// インクルード
//*****************************************************************************
#include "../../basic/basic.h"
#include <winsock.h>
#include "../../common/math/vector/vector3.h"
#include "network_data.h"
//*****************************************************************************
// ライブラリのリンク
//*****************************************************************************
#pragma comment (lib,"wsock32.lib")

//*****************************************************************************
// マクロ定義
//*****************************************************************************

//*****************************************************************************
// 構造体定義
//*****************************************************************************

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************

//*****************************************************************************
// クラスの前方参照
//*****************************************************************************
class CNetworkData;

//*****************************************************************************
// クラス定義
//*****************************************************************************
class CWindowsSockets : public CBasic
{
public:
	// コンストラクタ
	CWindowsSockets(const char* pIpAddress);

	// デストラクタ
	virtual ~CWindowsSockets(void);

	// 初期化処理
	bool Init(void);

	// 終了処理
	void Uninit(void);

	// プレイヤーIDリクエスト
	void RequestID(void);

	// データの送信
	void SendDataCharcter(VECTOR3* position, VECTOR3* rotation, int animation_id, int player_id);
	void SendDataBullet(VECTOR3* position, VECTOR3* front_vector, float speed, int player_id);

	void SendDataMyself(char* pData,int nSize);

	// データの受信
	int ReceiveData(NETWORK_DATA* pOutData, sockaddr_in* from_addres);

protected:

private:
	SOCKET m_Socket;
	char m_pIpAddress[256];
	struct sockaddr_in m_Sendaddr;
	struct sockaddr_in m_Recieveaddr;

	// マルチキャストアドレス

	// 送信先アドレス

	// 送信時のポート番号

	// 受信時のポート番号
};

#endif	// _WINDOWS_SOCKET_H_

//---------------------------------- EOF --------------------------------------
