//*****************************************************************************
//
// レンダーステートクラス
//
// Author		: Kenji Kabutomori
//
//*****************************************************************************

//*****************************************************************************
// インクルード
//*****************************************************************************
// basic
#include "basic/application.h"

// graphic
#include "interface/graphic/renderstate/state/renderstate_all.h"
#ifdef _USING_OPENGL_
#include "interface/graphic/renderstate/state/opengl/gl_renderstate_all.h"
#endif
#ifdef _USING_DIRECTX_
#include "interface/graphic/renderstate/state/directx/dx_renderstate_all.h"
#endif

// common
#include "common/common.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************

//*****************************************************************************
// 構造体定義
//*****************************************************************************

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************

//*****************************************************************************
// グローバル変数
//*****************************************************************************

//=============================================================================
// コンストラクタ
//=============================================================================
CRenderstateAll::CRenderstateAll(CDeviceHolder* device_holder) : CRenderstate(device_holder)
{
}

//=============================================================================
// デストラクタ
//=============================================================================
CRenderstateAll::~CRenderstateAll(void)
{
}

//=============================================================================
// 作成処理
//=============================================================================
CRenderstateAll* CRenderstateAll::Create(CDeviceHolder* device_holder)
{
	CRenderstateAll* renderstate_all = NULL;

#ifdef _USING_OPENGL_
	renderstate_all = new CGLRenderstateAll(device_holder);
#endif

#ifdef _USING_DIRECTX_
	renderstate_all = new CDXRenderstateAll(device_holder);
#endif

	return renderstate_all;
}

//---------------------------------- EOF --------------------------------------
