//*****************************************************************************
//
// レンダーステートライトオフクラス
//
// Author		: Kenji Kabutomori
//
//*****************************************************************************

//*****************************************************************************
// インクルード
//*****************************************************************************
// basic
#include "basic/application.h"

#include "interface/graphic/renderstate/state/renderstate_light_off.h"
#ifdef _USING_OPENGL_
#include "interface/graphic/renderstate/state/opengl/gl_renderstate_light_off.h"
#endif

#ifdef _USING_DIRECTX_
#include "interface/graphic/renderstate/state/directx/dx_renderstate_2d.h"
#endif

// common
#include "common/common.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************

//*****************************************************************************
// 構造体定義
//*****************************************************************************

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************

//*****************************************************************************
// グローバル変数
//*****************************************************************************

//=============================================================================
// コンストラクタ
//=============================================================================
CRenderstateLightOff::CRenderstateLightOff(CDeviceHolder* device_holder) : CRenderstate(device_holder)
{
}

//=============================================================================
// デストラクタ
//=============================================================================
CRenderstateLightOff::~CRenderstateLightOff(void)
{
}

//=============================================================================
// 作成処理
//=============================================================================
CRenderstateLightOff* CRenderstateLightOff::Create(CDeviceHolder* device_holder)
{
	CRenderstateLightOff* renderstate_light_off = NULL;

#ifdef _USING_OPENGL_
	renderstate_light_off = new CGLRenderstateLightOff(device_holder);
#endif

#ifdef _USING_DIRECTX_
	renderstate_2d = new CGLRenderstateLightOff(device_holder);
#endif

	return renderstate_light_off;
}

//---------------------------------- EOF --------------------------------------
